//
//  main.swift
//  ClassesAndStructs
//
//  Created by Валерия Пономарева on 30.10.2025.
//

import Foundation

print("ЗАДАЧА от Alex Efimov: начинающий блогер пишет статью о классах")

print("Задача: напиши класс Dog с перечислением + вычисляемые свойства + методы + тесты")

print("Задача: Система учета книг в библиотеке: Создай класс Book с свойствами: название, автор, доступность (true/false). Реализуй методы: взять книгу, вернуть книгу. Создай массив книг и выведи их список.")

print("Задача от А.Ефимова по теме 'Классы и экземпляры классов'.")

print("Задача: 'Система заказа в кофейне'.")

print("Lesson from Alex Efimov's course 'Junior iOS-Developer 2023'.")

print("Задача: 'Basket with fruits'.")

print("Задача: Система учета книг в библиотеке: Создай класс Book с свойствами: название, автор, доступность (true/false). Реализуй методы: взять книгу, вернуть книгу. Создай массив книг и выведи их список.")

print("HW 8: 2 задачи из курса А.Ефимова по теме 8 'Structs'.")

